There are no visible constraint targets in the current view. Please switch to another view.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
 Syntax
  C#
public static FailureDefinitionId NoVisibleTargetsForCurrentConstraint { get; }
  Visual Basic
Public Shared ReadOnly Property NoVisibleTargetsForCurrentConstraint As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NoVisibleTargetsForCurrentConstraint {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarFailures Class
  Autodesk.Revit.DB Namespace